app/views/articles/_form.html.erb

SELECT "authors".* FROM "authors"
---
  <%= f.label :author %> <br>
  <%= collection_select(:article, :author_id, Author.all, :id, :last_name, include_blank: true) %>

SELECT "tags".* FROM "tags"
---
<p>
  <%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name) %>