app/views/articles/show.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
---
  <p><%= @article.body %></p>
  <p>Written by: <%= @article.author.first_name %> <%= @article.author.last_name %></p>