app/controllers/articles_controller.rb

  def create
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Testing create with author"], ["body", "This this another test"], ["author_id", 2], ["created_at", "2016-03-19 15:32:56.875912"], ["updated_at", "2016-03-19 15:32:56.875912"]]