app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Olivia"], ["last_name", "DC"], ["created_at", "2016-03-21 13:43:55.833711"], ["updated_at", "2016-03-21 13:43:55.833711"]]
---
  def create
    @author = Author.new(author_params)
    if @author.save

UPDATE "authors" SET "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["last_name", "Des Chenes"], ["updated_at", "2016-03-21 13:47:56.617416"], ["id", 3]]
---
  def update
    if @author.update(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
---
    def find_author
      @author = Author.find(params[:id])