app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hysterical"], ["created_at", "2016-03-21 14:19:55.385908"], ["updated_at", "2016-03-21 14:19:55.385908"]]
---
  def create
    @tag = Tag.new(tag_params)
    if @tag.save

UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "Hysterically funny"], ["updated_at", "2016-03-21 14:20:48.357412"], ["id", 3]]
---
  def update
    if @tag.update(tag_params)

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]
---
    def find_tag
      @tag = Tag.find(params[:id])